      /if not defined(COPYRIGHT_DSPEC)
     h copyright('V5.1 - 20.12.2018 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     D EXPJRNE_VERSION...
     D                 C                   '5.1'
     D EXPJRNE_DATE...
     D                 C                   '20.12.2018'
