      /if not defined(COPYRIGHT_DSPEC)
     h copyright('V5.2 - 30.01.2022 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     D EXPJRNE_VERSION...
     D                 C                   '5.2'
     D EXPJRNE_DATE...
     D                 C                   '30.01.2022'
