      /if not defined(COPYRIGHT_DSPEC)
     h copyright('V5.0 - 02.11.2018 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     D EXPJRNE_VERSION...
     D                 C                   '5.0'
     D EXPJRNE_DATE...
     D                 C                   '02.11.2018'
