**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: TXT0001
//
//EXPJRNE - Exportierte Journaleinträge
//
dcl-ds TXT0001;
end-ds;
//  No replacement variables available!
dcl-s TXT0001_SIZE    int(10) inz(0000);
//
