      // ---------------------------------------------------------------
      //  Data structure for message ID: TXT0001
      //
      //EXPJRNE - Exportierte Journaleinträge
      //
     d TXT0001         ds
      //  No replacement variables available!
     d TXT0001_SIZE    s             10i 0 inz(0000)
      //
