**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0025

//  Ausführung der SQL Anweisung zum Setzen der Feldbeschreibun

dcl-ds USR0025;
  USR00251        char(0512) inz(*BLANKS);
end-ds;
dcl-s USR0025_SIZE    int(10) inz(0512);
