      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0027

      //  Ausführung der SQL Anweisung zum Setzen der Textbeschreibun

     d USR0027         ds
     d  USR00271                   0512A   inz(*BLANKS)
     d USR0027_SIZE    s             10I 0 inz(0512)
