**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0027

//  Ausfhrung der SQL Anweisung zum Setzen der Textbeschreibun

dcl-ds USR0027;
  USR00271        char(0512) inz(*BLANKS);
end-ds;
dcl-s USR0027_SIZE    int(10) inz(0512);
