      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0012

      //  Export der Journaleinträge läuft (&1) ...

     d USR0012         ds
     d  USR00121                   0015P 0 inz(*ZEROS )
     d USR0012_SIZE    s             10I 0 inz(0008)
