**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0012

//  Export der Journaleinträge läuft (&1) ...

dcl-ds USR0012;
  USR00121        packed(0015) inz(*ZEROS );
end-ds;
dcl-s USR0012_SIZE    int(10) inz(0008);
