      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0022

      //  Aktualitätsprüfung für Feld &3 in Datei &1 in Bibliothek &2

     d USR0022         ds
     d  USR00221                   0010A   inz(*BLANKS)
     d  USR00222                   0010A   inz(*BLANKS)
     d  USR00223                   0010A   inz(*BLANKS)
     d USR0022_SIZE    s             10I 0 inz(0030)
