      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0018

      //  &1 Journaleinträge aufgrund von Fehlern übergangen.

     d USR0018         ds
     d  USR00181                   0010A   inz(*BLANKS)
     d USR0018_SIZE    s             10I 0 inz(0010)
