**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0018

//  &1 Journaleinträge aufgrund von Fehlern übergangen.

dcl-ds USR0018;
  USR00181        char(0010) inz(*BLANKS);
end-ds;
dcl-s USR0018_SIZE    int(10) inz(0010);
