      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0031

      //  Ungültiges Zeitstempelfeld: &1.

     d USR0031         ds
     d  USR00311                     10A   inz(*BLANKS)
     d  USR00312                      2P 0 inz(*ZEROS )
     d USR0031_SIZE    s             10I 0 inz(12)
