**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0019

//  Feld oder Datzformat &1 umbenannt nach &2.

dcl-ds USR0019;
  USR00191        char(0010) inz(*BLANKS);
  USR00192        char(0010) inz(*BLANKS);
end-ds;
dcl-s USR0019_SIZE    int(10) inz(0020);
