**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0022

//  Aktualitätsprüfung für Feld &3 in Datei &1 in Bibliothek &2

dcl-ds USR0022;
  USR00221        char(0010) inz(*BLANKS);
  USR00222        char(0010) inz(*BLANKS);
  USR00223        char(0010) inz(*BLANKS);
end-ds;
dcl-s USR0022_SIZE    int(10) inz(0030);
