      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0019

      //  Feld oder Datzformat &1 umbenannt nach &2.

     d USR0019         ds
     d  USR00191                   0010A   inz(*BLANKS)
     d  USR00192                   0010A   inz(*BLANKS)
     d USR0019_SIZE    s             10I 0 inz(0020)
