      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0025

      //  Ausführung der SQL Anweisung zum Setzen der Feldbeschreibun

     d USR0025         ds
     d  USR00251                   0512A   inz(*BLANKS)
     d USR0025_SIZE    s             10I 0 inz(0512)
