**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0030

//  Feldüberlauf aufgetreten in Feld: &1

dcl-ds USR0030;
  USR00301        char(0010) inz(*BLANKS);
end-ds;
dcl-s USR0030_SIZE    int(10) inz(0010);
