**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0020

//  Unerlaubter Speicherzugriff. Programm beendet.

dcl-ds USR0020;
end-ds;
//  No replacement variables available!
dcl-s USR0020_SIZE    int(10) inz(0000);
