      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0026

      //  Ausführung der ASL Anweisung zum setzen der Spaltenüberschr

     d USR0026         ds
     d  USR00261                   0512A   inz(*BLANKS)
     d USR0026_SIZE    s             10I 0 inz(0512)
