**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0021

//  Aktualitätsprüfung für Datei &1 in Bibliothek &2.

dcl-ds USR0021;
  USR00211        char(0010) inz(*BLANKS);
  USR00212        char(0010) inz(*BLANKS);
end-ds;
dcl-s USR0021_SIZE    int(10) inz(0020);
