      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0021

      //  Aktualitätsprüfung für Datei &1 in Bibliothek &2.

     d USR0021         ds
     d  USR00211                   0010A   inz(*BLANKS)
     d  USR00212                   0010A   inz(*BLANKS)
     d USR0021_SIZE    s             10I 0 inz(0020)
