      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0024

      //  Ausführung der SQL Anweisung zum Erstellen der Ausgabedatei

     d USR0024         ds
     d  USR00241                   0512A   inz(*BLANKS)
     d USR0024_SIZE    s             10I 0 inz(0512)
