      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0020

      //  Unerlaubter Speicherzugriff. Programm beendet.

     d USR0020         ds
      //  No replacement variables available!
     d USR0020_SIZE    s             10I 0 inz(0000)
