      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0023

      //  &1: &2

     d USR0023         ds
     d  USR00231                   0010P 0 inz(*ZEROS )
     d  USR00232                   0256A   inz(*BLANKS)
     d USR0023_SIZE    s             10I 0 inz(0262)
