**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0026

//  Ausfhrung der ASL Anweisung zum setzen der Spaltenberschr

dcl-ds USR0026;
  USR00261        char(0512) inz(*BLANKS);
end-ds;
dcl-s USR0026_SIZE    int(10) inz(0512);
