      // ---------------------------------------------------------------
      //  Data structure for message ID: USR0030

      //  Feldüberlauf aufgetreten in Feld: &1

     d USR0030         ds
     d  USR00301                   0010A   inz(*BLANKS)
     d USR0030_SIZE    s             10I 0 inz(0010)
