**FREE
// ---------------------------------------------------------------
//  Data structure for message ID: USR0024

//  Ausfhrung der SQL Anweisung zum Erstellen der Ausgabedatei

dcl-ds USR0024;
  USR00241        char(0512) inz(*BLANKS);
end-ds;
dcl-s USR0024_SIZE    int(10) inz(0512);
